
const communes = {
  "01": ["أدرار", "تامست", "رقان", "زاوية كنتة", "أولف", "تيمقطن", "تمنطيط", "فنوغيل", "سالي", "أقبلي", "أولاد أحمد تيمي", "بودة", "سبع"],
  "02": ["الشلف", "تنس", "بنايرية", "أولاد فارس", "بوقادير", "أولاد بن عبد القادر", "أبو الحسن", "المرسى", "سيدي عبد الرحمن", "الزبوجة"],
  "03": ["الأغواط", "قصر الحيران", "حاسي الرمل", "حاسي الدلاعة", "عين ماضي", "عين سيدي علي", "بن ناصر", "بريدة", "الخنق", "المنيعة"],
  "04": ["أم البواقي", "عين مليلة", "عين البيضاء", "سيقوس", "الضلعة", "فكيرينة", "مسكيانة", "الزرق", "العامرية", "عين كرشة", "أولاد زواي"],
  "05": ["باتنة", "أريس", "تكوت", "بوزينة", "ثنية العابد", "عين التوتة", "المعذر", "تازولت", "نقاوس", "سريانة", "بريكة", "منعة", "مروانة"],
  "06": ["بجاية", "أميزور", "أوقاس", "تازمالت", "إغيل علي", "خراطة", "سيدي عيش", "تيفرة", "شميني", "بوخليفة", "ملبو", "فناية الماثن"],
  "07": ["بسكرة", "أورلال", "سيدي عقبة", "طولقة", "مشونش", "زريبة الوادي", "جمورة", "عين الناقة", "الحوش", "القنطرة", "ليوة", "لوطاية"],
  "08": ["بشار", "كرزاز", "بني عباس", "تاغيت", "العبادلة", "تامترت", "تامريست", "قنادسة", "إقلي", "بوشار", "العبادلة", "واكدة"],
  "09": ["البليدة", "البويرة", "بوفاريك", "بوعينان", "بني تامو", "أولاد يعيش", "واد العلايق", "الصومعة", "الشفة", "مفتاح", "الاربعاء", "موزاية", "العفرون"]
};

const wilayaSelect = document.getElementById("wilaya");
const communeSelect = document.getElementById("commune");

wilayaSelect.addEventListener("change", function () {
  const selectedWilaya = this.value;
  const relatedCommunes = communes[selectedWilaya] || [];

  communeSelect.innerHTML = '<option value="">اختر بلدية</option>';

  relatedCommunes.forEach(commune => {
    const option = document.createElement("option");
    option.value = commune;
    option.textContent = commune;
    communeSelect.appendChild(option);
  });
});

